import React from "react";
import { useEffect } from "react";

export default function Com() {
  useEffect(() => {
    window.scrollTo(0,0)
}, [])
  return (
    <div className="container text-center my-5">
      <div className="row mx-0">
        <div className="col-12 col-md-10 mx-auto py-5">
          <h3 className="text-center font-main">سياسة الخصوصية </h3>
          <span className="line"></span>
          <p className="font-main text-center" style={{ fontSize: "20px" }}>
            دم هو تطبيق مجاني. يتم توفير هذه الخدمة مجانًا وهي مخصصة للاستخدام
            كما هي. تُستخدم هذه الصفحة لإعلام الزائرين بشأن سياسة التطبيق بجمع
            المعلومات الشخصية واستخدامها والكشف عنها إذا قرر أي شخص استخدام
            الخدمة. إذا اخترت استخدام خدمتنا ، فأنت توافق على جمع واستخدام
            المعلومات المتعلقة بهذه السياسة. تُستخدم المعلومات الشخصية التي
            نجمعها لتوفير الخدمة وتحسينها. لن نستخدم أو نشارك معلوماتك مع أي شخص
            باستثناء ما هو موضح في سياسة الخصوصية هذه.
          </p>
          <p className="font-main text-center" style={{ fontSize: "20px" }}>
            المصطلحات المستخدمة في سياسة الخصوصية هذه لها نفس المعاني الواردة في
            الشروط والأحكام الخاصة بنا ، والتي يمكن الوصول إليها في بنك الدم
            الجزائري ما لم يتم تحديد خلاف ذلك في هذه سياسة الخصوصية.
          </p>
          <h3 className="text-center font-main pt-5">
            جمع واستخدام المعلومات{" "}
          </h3>
          <span className="line"></span>
          <p className="font-main text-center" style={{ fontSize: "20px" }}>
            أثناء استخدام خدمتنا قد يُطلب من المستخدم تزويدنا بمعلومات تعريف
            شخصية معينة سيتم الاحتفاظ بالمعلومات التي يطلبها على جهازك. يستخدم
            التطبيق خدمات الجهات الخارجية التي قد تجمع المعلومات المستخدمة
            لتحديد هويتك ويتم الربط بسياسة الخصوصية لمقدمي خدمات الطرف الثالث
            التي يستخدمها التطبيق. ويتم الربط مع مقدمي الخدمة للاسباب التالية:
          </p>
            <p className="font-main" style={{ fontSize: "20px" }}>لتسهيل خدمتنا -</p>
            <p className="font-main" style={{ fontSize: "20px" }}>لتقديم الخدمة نيابة عنا -</p>
            <p className="font-main" style={{ fontSize: "20px" }}>لأداء الخدمات المتعلقة بالخدمة  أو للمساعدة في تحليل كيفية استخدام خدمتنا  -</p>


            <p className="font-main text-center" style={{ fontSize: "20px" }}>
            <mark>
            أريد إبلاغ مستخدمي هذه الخدمة أن هذه الأطراف الثالثة لديها حق الوصول إلى معلوماتك الشخصية. والسبب هو أداء المهام الموكلة إليهم نيابة عنا. ومع ذلك ، فهم ملزمون بعدم الكشف عن المعلومات أو استخدامها لأي غرض آخر
            </mark>
          </p>
        </div>
      </div>
    </div>
  );
}
